# 04 - Pandas - Processamento e Análise de Dados
## Aula 11 - 04 - Pandas - Alinhamento de Dados e Aritmética entre Dataframes

## Professor: Orlando Oliveira dos Santos, MsC.
 - E-mail: professor.orlando.santos@gmail.com 
 - Youtube :https://www.youtube.com/channel/UCPWWbkPWFmOjXH50TQWNAYg
 - Linkedin: https://linkedin.com/in/orlandoosantos
 - Facebook: https://www.facebook.com/proforlandosantosmsc/
 - Twitter: https://twitter.com/ProfOrlandoMsC
 - Instagram: https://www.instagram.com/proforlandosantosmsc/



## Formação Acadêmica
- Mestrado em Computação Aplicada - UnB (2014 – 2016)	
- MBA, Administração Estratégica de Sistemas de Informação – FGV (2011 – 2013)
- Tecnólogo em Processamento de Dados, Análise e Desenvolvimento de Sistemas – FAETEC/SP (2000-2002)

# Pandas - Alinhamento de Dados e Aritmética entre Dataframes
## Pandas

O pandas é uma ferramenta de análise e manipulação de dados de código aberto rápida, poderosa, flexível e fácil de usar,
construída sobre a linguagem de programação Python 

https://pandas.pydata.org/

## Estruturas de dados do Pandas

In [1]:
import numpy as np
import pandas as pd

## Alinhamento de dados e aritmética 
O alinhamento de dados entre objetos DataFrame é alinhado automaticamente nas colunas e no índice (rótulos de linha) . Novamente, o objeto resultante terá a união dos rótulos de coluna e linha.

In [2]:
dados = {'percentualcomissao' : pd.Series([.05, .05, .5], index=['João','Alexandre','Willian']),
          'vendas' : pd.Series([100, 200, 300], index=['Willian','João','Alexandre']) }
dfcomissoes_janeiro = pd.DataFrame(dados)
dfcomissoes_janeiro

           percentualcomissao  vendas
Alexandre                0.05     300
João                     0.05     200
Willian                  0.50     100

In [3]:
dados = {'percentualcomissao' : pd.Series([.05, .05, .5], index=['João','Alexandre','Willian']),
          'vendas' : pd.Series([300, 400, 100], index=['Willian','João','Alexandre']) }
dfcomissoes_fevereiro = pd.DataFrame(dados)
dfcomissoes_fevereiro

           percentualcomissao  vendas
Alexandre                0.05     100
João                     0.05     400
Willian                  0.50     300

In [4]:
dfcomissoes_fevereiro + dfcomissoes_janeiro

           percentualcomissao  vendas
Alexandre                 0.1     400
João                      0.1     600
Willian                   1.0     400

In [5]:
import numpy as np

df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])

df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])

df + df2

          A         B         C   D
0  1.323237 -0.351848  1.327816 NaN
1 -1.644086  0.631162 -2.302193 NaN
2 -1.342988 -1.530823  0.144883 NaN
3 -0.986341 -1.035185  1.093337 NaN
4  0.720943 -0.893663 -0.221078 NaN
5  0.871924  0.384495 -1.442490 NaN
6  0.242735  1.274576 -0.423025 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

Ao fazer uma operação entre DataFrame e Series, o comportamento padrão é alinhar o índice Series nas colunas DataFrame , transmitindo assim por linha.

In [6]:
df = pd.read_csv('./content/totaisestados_arr.csv', sep=';',names =['UF','CASOS','OBITOS'])
df = df[['CASOS','OBITOS'] ]
df.head()

    CASOS  OBITOS
0  221526    3845
1  269857    6107
2   89654    1699
3  152968    4009
4   92951    2304

In [7]:
media = df.mean()

In [8]:
df.iloc[0]

CASOS     221526
OBITOS      3845
Name: 0, dtype: int64

In [9]:
(df - media).head()

          CASOS       OBITOS
0    1309.37037 -2357.037037
1   49640.37037   -95.037037
2 -130562.62963 -4503.037037
3  -67248.62963 -2193.037037
4 -127265.62963 -3898.037037

In [10]:
df.sub(df['CASOS'], axis=0)

    CASOS   OBITOS
0       0  -217681
1       0  -263750
2       0   -87955
3       0  -148959
4       0   -90647
5       0  -369432
6       0  -278661
7       0  -186118
8       0  -137132
9       0  -163843
10      0  -118359
11      0   -81732
12      0   -84095
13      0   -33016
14      0  -166433
15      0   -54869
16      0  -256311
17      0   -74508
18      0   -60292
19      0   -77474
20      0  -170086
21      0  -378146
22      0  -310698
23      0 -1143569
24      0  -240376
25      0  -280848
26      0  -303404

## operações com escalares

In [11]:
(df / 1000).head()

     CASOS  OBITOS
0  221.526   3.845
1  269.857   6.107
2   89.654   1.699
3  152.968   4.009
4   92.951   2.304

In [12]:
(df ** 2).head()

         CASOS    OBITOS
0  49073768676  14784025
1  72822800449  37295449
2   8037839716   2886601
3  23399209024  16072081
4   8639888401   5308416

Os operadores booleanos também funcionam:

In [13]:
df1 = pd.DataFrame({'a': [1, 0, 1], 'b': [0, 1, 1]}, dtype=bool)
df1.head()

       a      b
0   True  False
1  False   True
2   True   True

In [14]:
df2 = pd.DataFrame({'a': [0, 1, 1], 'b': [1, 1, 0]}, dtype=bool)
df2.head()

       a      b
0  False   True
1   True   True
2   True  False

In [15]:
df1 & df2

       a      b
0  False  False
1  False   True
2   True  False

In [16]:
df1 | df2

      a     b
0  True  True
1  True  True
2  True  True

In [17]:
df1

       a      b
0   True  False
1  False   True
2   True   True

In [18]:
-df1

       a      b
0  False   True
1   True  False
2  False  False

## Transpondo  o Dataframe
Para transpor, acesse o atributo T ou a função transpose

In [19]:
df = pd.read_csv('./content/totaisestados_arr.csv', sep=';',names =['UF','CASOS','OBITOS'])
df.head()

   UF   CASOS  OBITOS
0  DF  221526    3845
1  GO  269857    6107
2  MS   89654    1699
3  MT  152968    4009
4  AL   92951    2304

In [20]:
df.T

,0,1,2,3,4,5,6,7,8,9,...,17,18,19,20,21,22,23,24,25,26
UF,DF,GO,MS,MT,AL,BA,CE,MA,PB,PE,...,RO,RR,TO,ES,MG,RJ,SP,PR,RS,SC
CASOS,221526,269857,89654,152968,92951,377445,288122,190321,140355,172716,...,76019,61001,78618,174144,387751,332396,1184496,246169,287204,306788
OBITOS,3845,6107,1699,4009,2304,8013,9461,4203,3223,8873,...,1511,709,1144,4058,9605,21698,40927,5793,6356,3384

In [21]:
df.index =  df['UF']
df =  df[['CASOS', 'OBITOS']]
df.T

UF,DF,GO,MS,MT,AL,BA,CE,MA,PB,PE,...,RO,RR,TO,ES,MG,RJ,SP,PR,RS,SC
CASOS,221526,269857,89654,152968,92951,377445,288122,190321,140355,172716,...,76019,61001,78618,174144,387751,332396,1184496,246169,287204,306788
OBITOS,3845,6107,1699,4009,2304,8013,9461,4203,3223,8873,...,1511,709,1144,4058,9605,21698,40927,5793,6356,3384

In [22]:
df.T.T

      CASOS  OBITOS
UF
DF   221526    3845
GO   269857    6107
MS    89654    1699
MT   152968    4009
AL    92951    2304
BA   377445    8013
CE   288122    9461
MA   190321    4203
PB   140355    3223
PE   172716    8873
PI   120913    2554
RN    84381    2649
SE    86361    2266
AC    33725     709
AM   171161    4728
AP    55652     783
PA   263155    6844
RO    76019    1511
RR    61001     709
TO    78618    1144
ES   174144    4058
MG   387751    9605
RJ   332396   21698
SP  1184496   40927
PR   246169    5793
RS   287204    6356
SC   306788    3384

## Interoperabilidade de DataFrame com funções NumPy 
Ufuncs NumPy (log, exp, sqrt, ...) e várias outras funções NumPy podem ser usados sem problemas em Series e DataFrame, assumindo que os dados são numéricos

In [23]:
df[:]

      CASOS  OBITOS
UF
DF   221526    3845
GO   269857    6107
MS    89654    1699
MT   152968    4009
AL    92951    2304
BA   377445    8013
CE   288122    9461
MA   190321    4203
PB   140355    3223
PE   172716    8873
PI   120913    2554
RN    84381    2649
SE    86361    2266
AC    33725     709
AM   171161    4728
AP    55652     783
PA   263155    6844
RO    76019    1511
RR    61001     709
TO    78618    1144
ES   174144    4058
MG   387751    9605
RJ   332396   21698
SP  1184496   40927
PR   246169    5793
RS   287204    6356
SC   306788    3384

In [24]:
np.sum(df[['CASOS','OBITOS']])

CASOS     5945849
OBITOS     167455
dtype: int64

In [25]:
np.cumsum(df[['CASOS','OBITOS']]).tail()

      CASOS  OBITOS
UF
RJ  3921192  110995
SP  5105688  151922
PR  5351857  157715
RS  5639061  164071
SC  5945849  167455

In [26]:
np.asarray(df)

array([[ 221526,    3845],
       [ 269857,    6107],
       [  89654,    1699],
       [ 152968,    4009],
       [  92951,    2304],
       [ 377445,    8013],
       [ 288122,    9461],
       [ 190321,    4203],
       [ 140355,    3223],
       [ 172716,    8873],
       [ 120913,    2554],
       [  84381,    2649],
       [  86361,    2266],
       [  33725,     709],
       [ 171161,    4728],
       [  55652,     783],
       [ 263155,    6844],
       [  76019,    1511],
       [  61001,     709],
       [  78618,    1144],
       [ 174144,    4058],
       [ 387751,    9605],
       [ 332396,   21698],
       [1184496,   40927],
       [ 246169,    5793],
       [ 287204,    6356],
       [ 306788,    3384]], dtype=int64)

Em alguns casos o pandas irá alinhar automaticamente as entradas rotuladas como parte de um ufunc com várias entradas.

In [27]:
ser1 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
ser2 = pd.Series([1, 3, 5], index=['b', 'a', 'c'])
np.remainder(ser1, ser2)

a    1
b    0
c    3
dtype: int64

In [28]:
ser3 = pd.Series([2, 4, 6], index=['b', 'c', 'd'])
np.remainder(ser1, ser3)

a    NaN
b    0.0
c    3.0
d    NaN
dtype: float64

## Leituras Adicionais e Referências:

- Python Tutorial at W3Schools: https://www.w3schools.com/python/
- Python official documentation: https://docs.python.org/3/tutorial/index.html
- Pandas  official documentation: https://pandas.pydata.org/pandas-docs/stable/index.html